ZigaMahne/STM32WBAxx_DFP/CMSIS/SVD/STM32WBA65.svd
        <register>
          <name>FLASH_NSBOOTADD0R</name>
          <displayName>FLASH_NSBOOTADD0R</displayName>
          <description>FLASH boot address 0 register</description>
          <addressOffset>0x044</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000000F</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>NSBOOTADD0</name>
              <description>nonsecure boot base address 0
</description>
              <bitOffset>7</bitOffset>
              <bitWidth>25</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_NSBOOTADD1R</name>
          <displayName>FLASH_NSBOOTADD1R</displayName>
          <description>FLASH boot address 1 register</description>
          <addressOffset>0x048</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000000F</resetValue>
          <resetMask>0x0000000F</resetMask>
          <fields>
            <field>
              <name>NSBOOTADD1</name>
              <description>nonsecure boot address 1
</description>
              <bitOffset>7</bitOffset>
              <bitWidth>25</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_SECBOOTADD0R</name>
          <displayName>FLASH_SECBOOTADD0R</displayName>
          <description>FLASH secure boot address 0 register</description>
          <addressOffset>0x04C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>BOOT_LOCK</name>
              <description>Boot lock
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SECBOOTADD0</name>
              <description>Secure boot base address 0
</description>
              <bitOffset>7</bitOffset>
              <bitWidth>25</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_SECWM1R1</name>
          <displayName>FLASH_SECWM1R1</displayName>
          <description>FLASH bank 1 secure watermark register 1</description>
          <addressOffset>0x050</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFF00FF00</resetValue>
          <resetMask>0xFF00FF00</resetMask>
          <fields>
            <field>
              <name>SECWM1_PSTRT</name>
              <description>Bank 1 start page of secure area
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SECWM1_PEND</name>
              <description>Bank 1 end page of secure area
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_SECWM1R2</name>
          <displayName>FLASH_SECWM1R2</displayName>
          <description>FLASH bank 1 secure watermark register 2</description>
          <addressOffset>0x054</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0F000F00</resetValue>
          <resetMask>0x0F000F00</resetMask>
          <fields>
            <field>
              <name>HDP1_PEND</name>
              <description>Bank 1 end page of secure hide protection area
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HDP1EN</name>
              <description>Bank 1 secure Hide protection area enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>No bank 1 secure HDP area</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Bank 1 secure HDP area enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_WRP1AR</name>
          <displayName>FLASH_WRP1AR</displayName>
          <description>FLASH WRP bank 1 area A address register</description>
          <addressOffset>0x058</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0F00FF00</resetValue>
          <resetMask>0x0F00FF00</resetMask>
          <fields>
            <field>
              <name>WRP1A_PSTRT</name>
              <description>WPR bank 1 area A start page
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRP1A_PEND</name>
              <description>WPR bank 1 area A end page
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UNLOCK</name>
              <description>WPR bank 1 area A unlock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>WRP bank 1 area A start and end pages locked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>WRP bank 1 area A start and end pages unlocked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_WRP2AR</name>
          <displayName>FLASH_WRP2AR</displayName>
          <description>FLASH WRP bank 2 area A address register</description>
          <alternateRegister>FLASH_WRP1AR</alternateRegister>
          <addressOffset>0x058</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0F00FF00</resetValue>
          <resetMask>0x0F00FF00</resetMask>
          <fields>
            <field>
              <name>WRP2A_PSTRT</name>
              <description>WPR bank 2 area A start page
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRP2A_PEND</name>
              <description>WPR bank 2 area A end page
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UNLOCK</name>
              <description>WPR bank 2 area A unlock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>WRP bank 2 area A start and end pages locked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>WRP bank 2 area A start and end pages unlocked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_WRP1BR</name>
          <displayName>FLASH_WRP1BR</displayName>
          <description>FLASH WRP bank 1 area B address register</description>
          <addressOffset>0x05C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0F00FF00</resetValue>
          <resetMask>0x0F00FF00</resetMask>
          <fields>
            <field>
              <name>WRP1B_PSTRT</name>
              <description>WRP bank 1 area B start page
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRP1B_PEND</name>
              <description>WRP bank 1 area B end page
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UNLOCK</name>
              <description>WPR area B unlock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>WRP bank 1 area B start and end pages locked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>WRP bank 1 area B start and end pages unlocked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_WRP2BR</name>
          <displayName>FLASH_WRP2BR</displayName>
          <description>FLASH WRP bank 2 area B address register</description>
          <alternateRegister>FLASH_WRP1BR</alternateRegister>
          <addressOffset>0x05C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0F00FF00</resetValue>
          <resetMask>0x0F00FF00</resetMask>
          <fields>
            <field>
              <name>WRP2B_PSTRT</name>
              <description>WRP bank 2 area B start page
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRP2B_PEND</name>
              <description>WRP bank 2 area B end page
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UNLOCK</name>
              <description>WPR bank 2 area B unlock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>WRP bank 2 area B start and end pages locked</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>WRP bank 2 area B start and end pages unlocked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_SECWM2R1</name>
          <displayName>FLASH_SECWM2R1</displayName>
          <description>FLASH bank 2 secure watermark register 1</description>
          <addressOffset>0x060</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0xFF00FF00</resetValue>
          <resetMask>0xFF00FF00</resetMask>
          <fields>
            <field>
              <name>SECWM2_PSTRT</name>
              <description>Start page of secure area
</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SECWM2_PEND</name>
              <description>End page of secure area
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_SECWM2R2</name>
          <displayName>FLASH_SECWM2R2</displayName>
          <description>FLASH bank 2 secure watermark register 2</description>
          <addressOffset>0x064</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0F000F00</resetValue>
          <resetMask>0x0F000F00</resetMask>
          <fields>
            <field>
              <name>HDP2_PEND</name>
              <description>Bank 2 end page of secure hide protection area
</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HDP2EN</name>
              <description>Bank 2 secure Hide protection area enable</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>B_0x0</name>
                  <description>No bank 2 secure HDP area</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B_0x1</name>
                  <description>Bank 2 secure HDP area enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_OEM1KEYR1</name>
          <displayName>FLASH_OEM1KEYR1</displayName>
          <description>FLASH OEM1 key register 1</description>
          <addressOffset>0x070</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OEM1KEY</name>
              <description>OEM1 key least significant bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_OEM1KEYR2</name>
          <displayName>FLASH_OEM1KEYR2</displayName>
          <description>FLASH OEM1 key register 2</description>
          <addressOffset>0x074</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OEM1KEY</name>
              <description>OEM1 key most significant bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_OEM2KEYR1</name>
          <displayName>FLASH_OEM2KEYR1</displayName>
          <description>FLASH OEM2 key register 1</description>
          <addressOffset>0x078</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OEM2KEY</name>
              <description>OEM2 key least significant bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FLASH_OEM2KEYR2</name>
          <displayName>FLASH_OEM2KEYR2</displayName>
          <description>FLASH OEM2 key register 2</description>
          <addressOffset>0x07C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>OEM2KEY</name>
              <description>OEM2 key most significant bytes</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
